tutorials/heatTransfer/buoyantSimpleRadiationFoam/hotRadiationRoom/0/mut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      mut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    box
    {
        type            mutkWallFunction;
        value           uniform 0;
    }
    floor
    {
        type            mutkWallFunction;
        value           uniform 0;
    }
    ceiling
    {
        type            mutkWallFunction;
        value           uniform 0;
    }
    fixedWalls
    {
        type            mutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
